import sys

input = sys.stdin.readline

n = int(input())

"""
dp[1] = (2*1) => 1개 
dp[2] = (1*2) * 2 / (2*1) * 2 / (2*2) => 3개
dp[3] = { (가로) * 2 + (세로) } * (위치) / (세로) * 3 / (정사각형) + (세로) * (위치) => 5개
dp[4] = { (가로) * 2 + (세로) * 2 } * (위치3) / (가로) * 4 / (세로) * 4 / (정사각형) * 2 / { (가로) * 2 + (정사각형) } * (위치2) / { (세로) * 2 + (정사각형) } * (위치3) => 11개

dp[i] = dp[i-2] * 2 + dp[i-1]
"""
dp = [0 for _ in range(1001)]

dp[1] = 1
dp[2] = 3
for i in range(3, n+1):
    dp[i] = dp[i-2] * 2 + dp[i-1]

print(dp[n] % 10007)
